/*
标题:
计算整数各位数字之和

问题描述:	
假设n是一个由最多9位数字（d9, …, d1）组成的正整数。编写一个程序计算n的每一位数字之和
输入说明:	
输入数据为一个正整数n

输出说明:	
对整数n输出它的各位数字之和后换行

输入样例:	
3704

输出样例:	
14
*/
#include<stdio.h>
int main()
{
	int a,b,c,d,e,f,g,h,i,j,k;
	scanf("%d",&a);
	b = a / 100000000;
	c = (a - b*100000000) / 10000000;
	d = (a - b*100000000 - c*10000000) / 1000000;
	e = (a - b*100000000 - c*10000000 - d*1000000) / 100000;
	f = (a - b*100000000 - c*10000000 - d*1000000 - e*100000) / 10000;
	g = (a - b*100000000 - c*10000000 - d*1000000 - e*100000 - f*10000) / 1000;
	h = (a - b*100000000 - c*10000000 - d*1000000 - e*100000 - f*10000 - g*1000) / 100;
	i = (a - b*100000000 - c*10000000 - d*1000000 - e*100000 - f*10000 - g*1000 - h*100) / 10;
	j = (a - b*100000000 - c*10000000 - d*1000000 - e*100000 - f*10000 - g*1000 - h*100 - i*10) / 1;
	k = b+c+d+e+f+g+h+i+j;
	printf("%d",k); 
}
